app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)

        respond_to do |format|
            if @article.save
---
INSERT INTO "articles" ("name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sample"], ["body", "Booooody"], ["created_at", "2021-11-17 08:44:29.600279"], ["updated_at", "2021-11-17 08:44:29.600279"]]