app/controllers/categories_controller.rb

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "updated_at" = $1, "name" = $2 WHERE "categories"."id" = $3  [["updated_at", "2021-11-23 09:07:41.775616"], ["name", "new theme"], ["id", 102]]