app/controllers/games_controller.rb

INSERT INTO "games" ("name", "platform", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dota"], ["platform", "PC"], ["price", 200.0], ["created_at", "2021-11-06 03:52:05.744255"], ["updated_at", "2021-11-06 03:52:05.744255"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save