app/controllers/tasks_controller.rb

  def create
    @task = @category.tasks.build(task_params)
    if @task.save
---
INSERT INTO "tasks" ("category_id", "name", "body", "task_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["category_id", 2], ["name", "First task"], ["body", "Doing some tasks here"], ["task_date", 2021], ["created_at", "2021-12-05 07:11:55.566074"], ["updated_at", "2021-12-05 07:11:55.566074"]]

  def update
    @task = Task.find(params[:id])
    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "body" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["body", "Edited Journal"], ["updated_at", "2021-12-01 05:27:50.862580"], ["id", 1]]

  def destroy
    @task = Task.find(params[:id]).destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def get_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]