app/controllers/tasks_controller.rb

  def today
    @tasks = Task.where("Date(created_at) = ?", Date.today)
---
SELECT "tasks".* FROM "tasks" WHERE (Date(scheduled_at) = '2021-12-05')